---
kind: method
id: M:Autodesk.Revit.DB.ParameterMapIterator.MoveNext
source: html/41b239ee-3ea5-58e2-5e52-3c223770d61c.htm
---
# Autodesk.Revit.DB.ParameterMapIterator.MoveNext Method

Move the iterator one item forward.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
Returns True if the iterator was successfully moved forward one item and the Current
 property will return a valid item. False will be returned it the iterator has reached the end of
 the map.

## Remarks
MoveNext must be called before the Current property is valid with a new or Reset iterator
 in line with the expected behavior of IEnumerator.